"Welcome to the %s installer." = "Tervetuloa %s asentajaan.";

"Install" = "Asenna";

"Uninstall" = "Poista asennus";

"Install %s" = "Asenna %s";

"Uninstall %s" = "Poista asennus %s";

"Open %s..." = "Avaa %s...";

"OK" = "OK";

"%s Installed" = "%s asennettu";

"%s has been installed." = "%s on asennettu.";

"%s Uninstalled" = "%s poistettu";

"%s has been uninstalled." = "%s on poistettu.";

"%s Not Installed." = "%s-ohjelmaa ei asennettu.";

"%s Not Uninstalled." = "%s-ohjelmaa ei poistettu.";

"%s was NOT installed.  Please make sure you are running the installer from the disk image and try again." = "%s-ohjelmaa EI asennettu.  Tarkista että ajat asentajaa asennuslevyltä ja yritä uudelleen.";

"%s was NOT uninstalled.  Please make sure you are running the installer from the disk image and try again." = "%s-ohjelmaa EI poistettu. Tarkista että ajat asentajaa asennuslevyltä ja yritä uudelleen.";

"%s was NOT installed.  Please try again." = "%s-ohjelmaa EI asennettu.  Ole hyvä ja yritä uudelleen.";

"%s was NOT uninstalled.  Please try again." = "%s-ohjelmaa EI poistettu.  Ole hyvä ja yritä uudelleen.";

"Quit %s" = "Lopeta %s";

"Cancel" = "Kumoa";

"We have to quit %s before proceeding.  Quit %s now?" = "Ohjelma %s on lopetettava ennen kuin voidaan jatkaa.  Lopeta %s nyt?";

"Continue" = "Jatka";

"%s is still running.  Please quit %s and then click Continue." = "%s on edellleen käynnissä.  Ole hyvä ja lopeta %s ja paina sitten Jatka.";

// status messages

"Complete..." = "Valmis...";

"Quitting %s..." = "Lopetan %s...";

"Checking for %s..." = "Tarkistan %s...";

"Installing %s..." = "Asennan %s...";

"Uninstalling %s..." = "Poistan asennusta %s...";

"Quit" = "Lopeta";

// new

"Unsupported System" = "Unsupported System";

"%s was NOT installed.  Mac OS X %s or higher is required to run %s." = "%s was NOT installed.  Mac OS X %s or higher is required to run %s.";

"Accept" = "Hyväksy";

"Decline" = "Hylkää";

"%@ License Agreement" = "%@-lisenssisopimus";

"Print..." = "Tulosta...";
